---
kind: other
id: Properties.T:Autodesk.Revit.DB.PerformanceAdviser
source: html/a6323f90-0474-0034-0fd2-62e1e2d0d7ec.htm
---
# PerformanceAdviser Properties

Specifies whether the .NET object represents a valid Revit entity.